import 'package:rabonny/constants/books_data.dart';

class AppLists {

  static List<String> namesOfChaptersOldTestament = [
    "التكوين",
    "الخروج",
    "اللاويين",
    "العدد",
    "التثنية",
    "يشوع",
    "القضاة",
    "راعوث",
    "صموئيل الأول",
    "صموئيل الثاني",
    "الملوك الأول",
    "الملوك الثاني",
    "أخبار الأيام الأول",
    "أخبار الأيام الثاني",
    "عزرا",
    "نحميا",
    "طوبيا",
    "يهوديت",
    "أستير",
    "أيوب",
    "المزامير",
    "الأمثال",
    "الجامعة",
    "نشيد الأنشاد",
    "الحكمة",
    "يشوع ابن سيراخ",
    "إشعياء",
    "إرميا",
    "مراثي إرميا",
    "باروخ",
    "حزقيال",
    "دانيال",
    "هوشع",
    "يوئيل",
    "عاموس",
    "عوبديا",
    "يونان",
    "ميخا",
    "ناحوم",
    " حبقوق",
    "صفنيا",
    "حجي",
    "زكريا",
    "ملاخي",
    "المكابين الأول",
    "المكابين الثاني"
  ];
  static List<String> namesOfChaptersNewTestament = [
    "انجيل متى",
    "انجيل مرقس",
    "انجيل لوقا",
    "انجيل يوحنا",
    "أعمال الرسل",
    "الرسالة إلى اهل رومية",
    "الرسالة الأولى إلى اهل كورنثوس",
    "الرسالة الثانية إلى اهل كورنثوس",
    "الرسالة إلى اهل غلاطية",
    "الرسالة إلى اهل افسس",
    "الرسالة إلى اهل فيليبي",
    "الرسالة إلى اهل كولوسي",
    "الرسالة الأولى إلى اهل تسالونيكي",
    "الرسالة الثانية إلى اهل تسالونيكي",
    "الرسالة الأولى إلى  تيموثاوس",
    "الرسالة الثانية إلى تيموثاوس",
    "الرسالة إلى تيطس",
    "الرسالة إلى فيلمون",
    "الرسالة إلى العبرانيين",
    "رسالة يعقوب",
    "رسالة بطرس الأولى",
    "رسالة بطرس الثانية",
    "رسالة يوحنا الأولى",
    "رسالة يوحنا الثانية",
    "رسالة يوحنا الثالثة",
    "رسالة يهوذا",
    "سفر الرؤيا"
  ];
  static List<String> namesOfSalaot = [
    "باكر",
    "الساعة الثالثة",
    "الساعة السادسة",
    "الساعة التاسعة",
    "الغروب",
    "النوم",
    "الستار",
    "نصف الليل"
  ];static List<String> kholagySections = [
    "صلاه رفع بخور عشية وصلاة رفع بخور باكر",
    "صلوات قداس القديس باسيليوس",
    "صلوات قداس القديس غريغوريوس",
    "صلوات قداس القديس كيرلس (قداس مارمرقس)",
    "صلوات القسم المقدسة",
  ];static List<String> ebsalmodyaSections = [
    "تسبحة يوم الاحد",
    "تسبحة يوم الاثنين",
    "تسبحة يوم الثلاثاء",
    "تسبحة يوم الاربعاء",
    "تسبحة يوم الخميس",
    "تسبحة يوم الجمعة",
    "تسبحة يوم السبت",
  ];
  static List<String> booksGrid = [
    "holy bible",
    "agbya",
    "ebsalmodya",
    "ktab elasrar",
    "dlal holy week"
  ];
  static List<BookData> bookDataArr = [
    BookData(
        bookName: "الكتاب المقدس",
        bookPushNamed: "holybibleSelect",
        imgPath: "assets/images/الكتاب-المقدس.png"),
    BookData(
        bookName: "الأجبية",
        bookPushNamed: "agbyaSelect",
        imgPath: "assets/images/الاجبية 2.png"),
    BookData(
        bookName: "الخولاجى المقدس",
        bookPushNamed: "kholagySelect",
        imgPath: "assets/images/الخولاجي.png"),
    BookData(
        bookName: "الأبصلمودية",
        bookPushNamed: "ebsalmodyaSelect",
        imgPath: "assets/images/الابصلمودية.png"),
    BookData(
        bookName: "القطمارس",
        bookPushNamed: "katamars",
        imgPath: "assets/images/القطمارس.png"),
  ];
  
  
}